[
  {
    "text": "Az NT ütemezője a kernel módban, egy darab ütemező modulban található",
    "answer": false
  },
  {
    "text": "A tároló méretét megnövelve a FAT mérete nem arányosan növekszik",
    "answer": false
  },
  {
    "text": "Az exokernel gyakorlatilag rendszer rutinkönyvtárat jelent",
    "answer": true
  },
  {
    "text": "A monitor programszerkezetben két feltételváltozó és két művelet van",
    "answer": false
  },
  {
    "text": "A biztonsági másolat egy adott állomány dupla (esetleg többszörös) tárolása, az eredeti állománnyal egyező tárhelyen",
    "answer": false
  },
  {
    "text": "Informatikai szempontból a 'random' a 'sequence' ellentéte",
    "answer": true
  },
  {
    "text": "Egy folyamathoz több IOCB is tartozhat",
    "answer": true
  },
  {
    "text": "A gyorsító tár gyorsabb, mint az egyik hozzá kapcsolódó, gyorsítandó tár",
    "answer": true
  },
  {
    "text": "A független folyamatok jellemzően aszinkron működésűek",
    "answer": true
  },
  {
    "text": "Az átlátszóság azt jelenti, hogy egy szolgáltatás igénybevétele független a szolgáltatás fizikai helyétől, illetve a szolgáltatást biztosító hardvertől és szoftvertől",
    "answer": true
  },
  {
    "text": "A Windows NT ha lehetősége van rá, szálütemezést használ",
    "answer": false
  },
  {
    "text": "Az operációs rendszer közvetlenül kommunikál a hardverrel",
    "answer": false
  },
  {
    "text": "A Disc Interleaving optimális logikai sáv sorrendet jelent",
    "answer": false
  },
  {
    "text": "Az operációs rendszer szintjén egy Windows NT szálat egy ún executive szál blokk (ETHREAD) reprezentál",
    "answer": true
  },
  {
    "text": "A UNIX kernel módban preemptív ütemezést használ, de user módban nem preemptív ütemezést használ",
    "answer": false
  },
  {
    "text": "Az egyidejűség esetén a folyamatoknak be kell várniuk egymást",
    "answer": true
  },
  {
    "text": "Az NT virtuális tárkezelése lapszervezést használ",
    "answer": true
  },
  {
    "text": "Az NTFS írási folyamata hat lépésből áll",
    "answer": false
  },
  {
    "text": "Indirekt kommunikáció esetén jellemző a portok használata",
    "answer": false
  },
  {
    "text": "A MAR írni vagy olvasni kívánt memória címét tartalmazza",
    "answer": true
  },
  {
    "text": "Az igény szerinti lapozás csak a laphibát megszüntető lapot teszi át RAM-ba",
    "answer": true
  },
  {
    "text": "Az FCFS preemptív algoritmus",
    "answer": false
  },
  {
    "text": "A trójai programok képesek \"önálló\" akciókra, a felhasználó közreműködése nélkül is bejuthatnak a rendszerbe",
    "answer": false
  },
  {
    "text": "A szabályzás zárt hatásláncú folyamat",
    "answer": true
  },
  {
    "text": "A Master File Table nem más, mint logikai clusterek sorozata",
    "answer": false
  },
  {
    "text": "A linux különböző verzióira a monolitikus vagy a hibrid kernel jellemző",
    "answer": true
  },
  {
    "text": "A deklaratív programozás két fő iránya a logikai és a funkcionális programozás",
    "answer": true
  },
  {
    "text": "Az UNIX user módban preemptív ütemezést használ, kernel módban viszont nem preemptív ütemezést használ",
    "answer": true
  },
  {
    "text": "A Round-Robin algoritmus túl hosszú időszelet esetén FCFS jellegűvé válik",
    "answer": true
  },
  {
    "text": "Indirekt kommunikáció esetén a folyamatok közvetlenül nevezik meg egymást",
    "answer": false
  },
  {
    "text": "Az NT ütemezése szál alapú, prioritásvezérelt és preemptív",
    "answer": true
  },
  {
    "text": "A KERNEL réteg egyik alapvető feladata az LPC szolgáltatás megvalósítása",
    "answer": false
  },
  {
    "text": "A Second Chance lapcsere nem használ reference bitet",
    "answer": false
  },
  {
    "text": "A vírusok - a férgekkel ellentétben - képesek \"önálló\" akcióra, a felhasználó közreműködése nélkül is tudnak terjedni",
    "answer": false
  },
  {
    "text": "A kölcsönös kizárás a nem megosztható erőforrások esetében nem küszöbölhető ki",
    "answer": true
  },
  {
    "text": "Láncolt lista esetén egy blokk sérülése a tárolt adat elvesztését okozhatja",
    "answer": true
  },
  {
    "text": "Az FCFS nem preemptív algoritmus",
    "answer": true
  },
  {
    "text": "A Commit az NT memóriafoglalásának első lépése",
    "answer": false
  },
  {
    "text": "Az igény szerinti lapozás nem csak a laphibát megszüntető lapot teszi a RAM-ba",
    "answer": false
  },
  {
    "text": "Az intel i7 CPU esetében a Memory Controller területarányosan sok magnyi részt foglal el",
    "answer": true
  },
  {
    "text": "A verem egy szálra jellemző elem",
    "answer": true
  },
  {
    "text": "A ferritgyűrűs tár olvasás művelete összetetteb az írásnál műveletnél",
    "answer": true
  },
  {
    "text": "A LED lézer technológia esetén a lapméret növelése jelentős készülékméret növekedést eredményez",
    "answer": true
  },
  {
    "text": "A kritikus szakaszba a belépést csak szoftveres úton engedélyezhetjük",
    "answer": false
  },
  {
    "text": "Az NT ütemezője a kernel kódjában szétszórva található",
    "answer": true
  },
  {
    "text": "A PCB processzor szintű adatokat is tartalmaz",
    "answer": true
  },
  {
    "text": "Az NTFS Metadata azoknak az adatoknak a gyűjteménye, amelyek egy fájlrendszer kezeléséhez, illetve a benne tárolt fájlok eléréshez szükségesek",
    "answer": true
  },
  {
    "text": "Az NTDLL DLL a user mód legalsó rétege",
    "answer": true
  },
  {
    "text": "Egy elosztott rendszer minden gépe egyértelműen azonosítható és címezhető",
    "answer": false
  },
  {
    "text": "A LED lézer technológia esetén a lapméret nem eredményez jelentős készülékméret növekedést",
    "answer": false
  },
  {
    "text": "A 'Spooling' technológia háttértárat igényel",
    "answer": true
  },
  {
    "text": "A HPFS jellemzője a magic number",
    "answer": false
  },
  {
    "text": "A MAR tartalmazza az írni vagy olvasni kívánt memória címét nem tartalmazza",
    "answer": false
  },
  {
    "text": "Az összes EXT file rendszer használja a naplózást",
    "answer": false
  },
  {
    "text": "Az SJF algoritmus prioritásos és preemptív",
    "answer": false
  },
  {
    "text": "A monitorok programszerkezetben egy feltételváltozó és 2 művelet van",
    "answer": true
  },
  {
    "text": "A Logical Cluster a lemezen található clusterek azonosítására szolgál",
    "answer": false
  },
  {
    "text": "Az EREW PRAM gyakorlatilag a RAM modellhez hasonló működést produkál",
    "answer": true
  },
  {
    "text": "Hibrid kernel pl: Unixra jellemző",
    "answer": false
  },
  {
    "text": "A memória védelme alatt azt értjük, hogy az osztott elérésű memórián kívül se a folyamatok se az operációs rendszer ne legyen képes módosítani egy másik folyamat címtartományába tartozó memóriaterületet",
    "answer": true
  },
  {
    "text": "Az előretekintő lapozás becslésen alapul",
    "answer": true
  },
  {
    "text": "NT alapú rendszerekben minden szál alacsony prioritással kezdi futását",
    "answer": false
  },
  {
    "text": "Hálózati operációs rendszerek átlátszóságot biztosítanak",
    "answer": false
  },
  {
    "text": "A plug-and-play kezelő a Windows 2000 óta része a rendszernek",
    "answer": true
  },
  {
    "text": "A spooling technológia nem igényel háttértárat",
    "answer": false
  },
  {
    "text": "A virtuális memória méretének az operatív tár mérete szab határt",
    "answer": true
  },
  {
    "text": "Az UFS jellemzője a naplózás",
    "answer": false
  },
  {
    "text": "A RAM jelentése „Véletlen hozzáférésű Memória”",
    "answer": false
  },
  {
    "text": "AZ AMD K-6 processzor 64 bites szervezésű",
    "answer": false
  },
  {
    "text": "Egy HDD jellemzően rendelkezik FirmWare-el",
    "answer": true
  },
  {
    "text": "A POST a FirmWare egyik szolgáltatása",
    "answer": true
  },
  {
    "text": "A szabályzás nyílt hatásláncú folyamat",
    "answer": false
  },
  {
    "text": "A RAM jelentése \"tetszőleges hozzáférésű memória\"",
    "answer": true
  },
  {
    "text": "Az Intel Core processzor család 32 bites szervezésű",
    "answer": false
  },
  {
    "text": "SWAP nem alkalmas a várakozási idő elviselhető szinten tartására",
    "answer": true
  },
  {
    "text": "Láncolt lista esetén külső tördelődés nem lép fel",
    "answer": true
  },
  {
    "text": "Mikrokernel pl: a Windows rendszerekre jellemző",
    "answer": false
  },
  {
    "text": "A maszkolható megszakítások végrehajtása nem prioritásfüggő",
    "answer": false
  },
  {
    "text": "A PCB folyamatvezérlési adatokat nem tartalmaz",
    "answer": false
  },
  {
    "text": "A Windows kernel user módban is preemptív ütemezést használ",
    "answer": true
  },
  {
    "text": "A *dll fájlok a programok igényei szerint töltődnek be a memóriába",
    "answer": true
  },
  {
    "text": "A HRR algoritmus nem használ öregítést",
    "answer": false
  },
  {
    "text": "Az SMQ jobban kezeli a kiéheztetést mint az MFQ",
    "answer": false
  },
  {
    "text": "A Szemafor három műveletet használ",
    "answer": true
  },
  {
    "text": "Az CRCW PRAM tekinthető a klasszikus PRAM modellnek (-CRCW PRAM: mindent enged párhuzamosan)",
    "answer": true
  },
  {
    "text": "A TestAndSet független a PRAM modell műveleti sorrendjétől",
    "answer": false
  },
  {
    "text": "Egy folyamathoz több PCB is tartozhat",
    "answer": false
  },
  {
    "text": "Az UNIX kernel és user módban is preemptív ütemezést használ",
    "answer": false
  },
  {
    "text": "A laphiba azt jelenti, hogy a keresett lap nem található a RAM-ban",
    "answer": true
  },
  {
    "text": "A SMQ nem mentes a kiéheztetéstől",
    "answer": true
  },
  {
    "text": "A szálak közvetlenül, saját igény alapján jutnak erőforrásokhoz",
    "answer": false
  },
  {
    "text": "A készülék kezelő réteg jellemzően használ IRQ-t és DMA-t",
    "answer": true
  },
  {
    "text": "A globális változók szálra jellemző elemek",
    "answer": false
  },
  {
    "text": "RAM modell esetén a memória rekeszenként címezhető",
    "answer": true
  },
  {
    "text": "A Szemafor három változót használ",
    "answer": false
  },
  {
    "text": "A HAL réteg a használt CPU típusától függ",
    "answer": true
  },
  {
    "text": "A számítógép hálózatok egyik fontos jellemzője az átlátszóság",
    "answer": false
  },
  {
    "text": "A rövid távú ütemező nem kell, hogy egyfolytában a memóriában legyen",
    "answer": false
  },
  {
    "text": "A Szemafor egy változót használ",
    "answer": true
  },
  {
    "text": "Az RR (Round Robin) preemptív algoritmus",
    "answer": true
  },
  {
    "text": "A mentésnél jellemzően nem cél a keresés biztosítása",
    "answer": true
  },
  {
    "text": "A JFS jellemzője a naplózás",
    "answer": true
  },
  {
    "text": "Az együttműködés főleg a user folyamatokra jellemző",
    "answer": false
  },
  {
    "text": "A versengés a user folyamatokra jellemző",
    "answer": true
  },
  {
    "text": "Az NT ütemezője a kernel kódjában szétszórva található",
    "answer": true
  },
  {
    "text": "RP a RAM sor címzési idejét mutatja meg",
    "answer": false
  },
  {
    "text": "Az EEPROM blokkonként is törölhető",
    "answer": false
  },
  {
    "text": "A ROM csak egyszer írható",
    "answer": true
  },
  {
    "text": "Egy HDD jellemzően rendelkezik BIOS-sal",
    "answer": false
  },
  {
    "text": "Az Intel i3,i5, i7 processzor családok 32 bites szervezésűek",
    "answer": false
  },
  {
    "text": "A TestAndSet független a PRAM modell műveleti sorrendjétől",
    "answer": false
  },
  {
    "text": "Ütemezést kiváltó esemény lehet, amikor a futó folyamat várakozni kényszerül",
    "answer": true
  },
  {
    "text": "A objektumkezelő a kernel réteg egyik komponense",
    "answer": true
  },
  {
    "text": "Az FCFS nem primitív algoritmus",
    "answer": true
  },
  {
    "text": "Ütemezést kiváltó esemény lehet amikor a futó folyamat várakozni kényszerül",
    "answer": true
  },
  {
    "text": "Egy folyamathoz több PCB tartozik",
    "answer": false
  },
  {
    "text": "Az assembly utasítások számokból állnak",
    "answer": false
  },
  {
    "text": "Az LPC a folyamatok közötti kommunikációt biztosítja gyors üzenettovábbítással",
    "answer": true
  },
  {
    "text": "A blokkok szektorokból állnak",
    "answer": false
  },
  {
    "text": "A mentésnél jellemzően cél a keresés biztosítása",
    "answer": false
  },
  {
    "text": "A Virtual Cluster az egy fájlhoz tartozó clusterek sorszáma",
    "answer": false
  },
  {
    "text": "Az NTDLL DLL a kernel mód legalsó rétege",
    "answer": false
  },
  {
    "text": "Elosztott fájlrendszer esetén a fájlok állapottere csak uniform lehet",
    "answer": false
  },
  {
    "text": "Az utasításszámláló nem szükségszerű eleme egy szálnak",
    "answer": false
  },
    {
    "text": "Az NMI azonnal végrehajtandó, maszkolható megszakítást jelent",
    "answer": false
  },
  {
    "text": "Az IRQ végrehajtása annak prioritási szintjétől függ",
    "answer": true
  },
  {
    "text": "Az oszthatatlan műveleteket csak az NMI szakíthatja meg",
    "answer": false
  },
  {
    "text": "Hibrid kernel pl: az OS X-re jellemző",
    "answer": false
  },
  {
    "text": "A Szemafor a szinkronizációs problémák univerzális eszköze",
    "answer": true
  },
  {
    "text": "A Master File Table nem más, mint a fájl rekordok sorozata",
    "answer": true
  },
  {
    "text": "A Reserve az NT memóriafoglalásának első lépése",
    "answer": true
  },
  {
    "text": "Az igény szerinti lapozás csak a laphibát megszüntető lapot teszi át a RAM-ba",
    "answer": true
  },
  {
    "text": "Az NT alapú rendszerekben egy szálnak az ütemezés során 6 féle állapota lehet",
    "answer": false
  },
  {
    "text": "Az indexelt tárolást takarékos helygazdálkodás jellemzi",
    "answer": false
  },
  {
    "text": "A HRR algoritmus nem használ öregítést",
    "answer": false
  },
  {
    "text": "A hosszú távú ütemező gyorsabb, mint a középtávú ütemező",
    "answer": false
  },
  {
    "text": "A PCB struktúrájának 4 fő része van",
    "answer": false
  },  
  {
    "text": "A DMA segítségével a perifériák közvetlenül elérhetik a memóriát",
    "answer": true
  },
  {
    "text": "A MAR írni és olvasni kívánt memória tartalmát tartalmazza",
    "answer": false
  },
  {
    "text": "A HAL réteg feladata többek közt a multiprocesszor ütemezés",
    "answer": false
  },
  {
    "text": "A RAM jelentése \"Tetszőleges Hozzáférésű Memória\"",
    "answer": true
  },
  {
    "text": "A Resident Monitor a memóriát több részre osztva kezeli",
    "answer": true
  },
  {
    "text": "Preemptív ütemezés esetén a kiosztott futási jog elvehető",
    "answer": true
  },
  {
    "text": "A Round-Robin algoritmus jellemzője a konvoj hatás",
    "answer": false
  },
  {
    "text": "A SJF algoritmus fő szempontja a hosszú löketidő",
    "answer": false
  },
  {
    "text": "A SMQ mentes a kiéheztetéstől",
    "answer": false
  },
  {
    "text": "A nehéz súlyú folyamat képes szálakra bomlani",
    "answer": false
  },
  {
    "text": "A farmer-worker modellt az adóoldali port jellemzi",
    "answer": true
  },
  {
    "text": "A csoportkommunikációt több adó oldali folyamat jellemzi",
    "answer": false
  },
  {
    "text": "A “Spooling” technológia nem igényel háttértárat",
    "answer": false
  },
  {
    "text": "A Resident Monitor egy hardver komponens",
    "answer": false
  },
  {
    "text": "A preemptív ütemezés esetén a kiosztott futási jog nem vehető el",
    "answer": false
  },
  {
    "text": "A közép távú ütemező nem kapcsolatos a háttértárral",
    "answer": false
  },
  {
    "text": "A Round-Robin nem preemptív algoritmus",
    "answer": false
  },
  {
    "text": "A könnyű súlyú folyamatok szálai osztoznak az erőforrásokon",
    "answer": true
  },
  {
    "text": "A folyamatok változásához csak egy veremtárra van szükség",
    "answer": false
  },
  {
    "text": "Az EREW PRAM tekinthető a klasszikus PRAM modellnek",
    "answer": false
  },
  {
    "text": "A kliens-szerver modellt a vevőoldali port jellemzi",
    "answer": true
  },
  {
    "text": "Az operációs rendszer a hardver és a felhasználó közötti közvetítő.",
    "answer": true
  },
  {
    "text": "Az operációs rendszer célja kizárólag a processzor maximális kihasználása.",
    "answer": false
  },
  {
    "text": "A BIOS és az UEFI az operációs rendszer és a hardver közötti kapcsolatot biztosítja.",
    "answer": true
  },
  {
    "text": "Az első számítógépek rendelkeztek billentyűzettel és grafikus kijelzővel.",
    "answer": false
  },
  {
    "text": "A spooling technika lehetővé teszi több program egyidejű tárolását és feldolgozását.",
    "answer": true
  },
  {
    "text": "A multiprogramozott rendszerek egyszerre egy programot képesek futtatni.",
    "answer": false
  },
  {
    "text": "Az időosztásos rendszerek lehetővé teszik több felhasználó számára a számítógép egyidejű használatát.",
    "answer": true
  },
  {
    "text": "A kernel a felhasználó által közvetlenül vezérelhető programrész.",
    "answer": false
  },
  {
    "text": "A mikrokernelek csak minimális funkcionalitást biztosítanak a hardverhez való hozzáféréshez.",
    "answer": true
  },
  {
    "text": "A hibrid kernelek kizárólag a mikrokernelek elveit alkalmazzák.",
    "answer": false
  },
  {
    "text": "Az exokernelek nem biztosítanak állandó rendszermagot.",
    "answer": true
  },
  {
    "text": "A kernel és a user mód között nincs semmilyen kommunikáció.",
    "answer": false
  },
  {
    "text": "A Resident Monitor a memóriát több részre osztva kezeli.",
    "answer": true
  },
  {
    "text": "A szálak mindig osztoznak az erőforrásokon.",
    "answer": false
  },
  {
    "text": "A batch feldolgozás során az operátor feladata a programozás.",
    "answer": false
  },
  {
    "text": "A RAM jelentése random access memory, azaz véletlen hozzáférésű memória.",
    "answer": true
  },
  {
    "text": "A multiprogramozás célja a processzor kihasználtságának növelése.",
    "answer": true
  },
  {
    "text": "A spooling technika a processzor és a perifériák közti kapcsolatot gyorsítja.",
    "answer": true
  },
  {
    "text": "A kernel szintű szolgáltatások mind a felhasználói szinten futnak.",
    "answer": false
  },
  {
    "text": "A Windows Vista fejlesztése során a lassú kódoptimalizálásra építettek.",
    "answer": true
  },
  {
    "text": "A BIOS szerepe kizárólag a hardverek közötti kommunikáció biztosítása.",
    "answer": false
  },
  {
    "text": "A multiprogramozásban a processzor sosem várakozik perifériára.",
    "answer": false
  },
  {
    "text": "A spooling technika a mágneses háttértárat használja puffertárként.",
    "answer": true
  },
  {
    "text": "A kernel az operációs rendszer szíve, amely közvetlenül a hardverrel kommunikál.",
    "answer": true
  },
  {
    "text": "A mikrokernelek minden funkciót a kernelbe integrálnak.",
    "answer": false
  },
  {
    "text": "A monolitikus kernel egy nagy program, amely minden funkciót tartalmaz.",
    "answer": true
  },
  {
    "text": "A kernel általában több rétegből áll, amelyek hierarchikus szerkezetben helyezkednek el.",
    "answer": true
  },
  {
    "text": "A RAM memóriában az adatok tetszőleges sorrendben érhetők el.",
    "answer": true
  },
  {
    "text": "A kötegelt feldolgozás csökkentette a holtidőt az operátor bevonásával.",
    "answer": true
  },
  {
    "text": "A kernel részei közvetlenül a felhasználó által futtatott programokból állnak.",
    "answer": false
  },
  {
    "text": "A multiprogramozott rendszerek előtt a számítógépek kizárólag szekvenciálisan futtatták a programokat.",
    "answer": true
  },
  {
    "text": "A folyamat a számítási feladatok végrehajtásának alapegysége.",
    "answer": true
  },
  {
    "text": "A futásra kész állapotban lévő folyamat már rendelkezik a CPU-val.",
    "answer": false
  },
  {
    "text": "A Hyper-threading technológia a folyamatok számát növeli.",
    "answer": false
  },
  {
    "text": "A CPU időosztásos működése a rövid távú ütemező feladata.",
    "answer": true
  },
  {
    "text": "A megszakítás segítségével a futó folyamat sosem áll le.",
    "answer": false
  },
  {
    "text": "A környezetváltás során a futó folyamat állapota elmentésre kerül.",
    "answer": true
  },
  {
    "text": "A processzor igénybevétele az operációs rendszer működéséhez nem szükséges.",
    "answer": false
  },
  {
    "text": "A megszakításokat kizárólag programhibák okozhatják.",
    "answer": false
  },
  {
    "text": "A megszakítás lehet maszkolható vagy nem maszkolható.",
    "answer": true
  },
  {
    "text": "A megszakítás egy olyan művelet, amely a futó folyamat végrehajtását felfüggeszti.",
    "answer": true
  },
  {
    "text": "A folyamat vezérlési adatai tartalmazzák a programszámlálót is.",
    "answer": true
  },
  {
    "text": "A PCB tárolja a CPU-regiszterek aktuális állapotát is.",
    "answer": true
  },
  {
    "text": "A DMA segítségével a perifériák közvetlenül hozzáférhetnek a memóriához.",
    "answer": true
  },
  {
    "text": "Az I/O műveletek paramétereit a PCB-ben tároljuk.",
    "answer": false
  },
  {
    "text": "A folyamatok közötti váltás során a környezetet mindig el kell menteni.",
    "answer": true
  },
  {
    "text": "A processzorhoz egyszerre csak egy futó folyamat tartozhat.",
    "answer": true
  },
  {
    "text": "Az I/O műveletek nem szakíthatják meg a futó folyamatot.",
    "answer": false
  },
  {
    "text": "A nem maszkolható megszakításokat nem lehet késleltetni.",
    "answer": true
  },
  {
    "text": "Az IRQ-k maszkolható megszakítások.",
    "answer": true
  },
  {
    "text": "A folyamatok között oszthatatlan műveleteket tartalmazó folyamatok is lehetnek.",
    "answer": true
  },
  {
    "text": "Az operációs rendszer nem képes megszakítani a folyamatokat.",
    "answer": false
  },
  {
    "text": "A multiprogramozás nem biztosít párhuzamos működést.",
    "answer": false
  },
  {
    "text": "Az időosztásos rendszerek egyszerre több felhasználó számára biztosítanak működést.",
    "answer": true
  },
  {
    "text": "A megszakítások kizárólag hardverhibák esetén történnek.",
    "answer": false
  },
  {
    "text": "A rövid távú ütemező a CPU erőforrásainak elosztásáért felelős.",
    "answer": true
  },
  {
    "text": "A folyamatok szülei és gyerekei is azonosítókkal rendelkeznek.",
    "answer": true
  },
  {
    "text": "A környezetváltás során a teljes folyamatállapotot átmásoljuk a memóriába.",
    "answer": true
  },
  {
    "text": "A CPU-ütemezési információk tartalmazzák a prioritásokat és a jogosultságokat is.",
    "answer": true
  },
  {
    "text": "A processzek között csak a futási sorrend alapján történik váltás.",
    "answer": false
  },
  {
    "text": "Az ütemezés az ütemezendő események sorrendjének meghatározását jelenti.",
    "answer": true
  },
  {
    "text": "A rövid távú ütemező a CPU löket után fut le, ezért gyorsnak kell lennie.",
    "answer": true
  },
  {
    "text": "A preemptív ütemezésnél a futási jogot nem lehet elvenni az éppen futó folyamattól.",
    "answer": false
  },
  {
    "text": "A nem preemptív ütemezésnél a futási jog elvehető az éppen futó folyamattól.",
    "answer": false
  },
  {
    "text": "A Windows NT alapú rendszerek preemptív ütemezést használnak.",
    "answer": true
  },
  {
    "text": "A UNIX kernel módban preemptív, user módban nem preemptív ütemezést használ.",
    "answer": false
  },
  {
    "text": "Az ütemezést kiváltó események közé tartozik a futó folyamat befejeződése.",
    "answer": true
  },
  {
    "text": "Homogén rendszerek esetén minden CPU mag külön várakozási sort használ.",
    "answer": false
  },
  {
    "text": "Heterogén rendszerekben a folyamatok csak a nekik megfelelő utasításkészletű CPU-n futnak.",
    "answer": true
  },
  {
    "text": "A szimmetrikus ütemezésnél egyetlen CPU mag futtatja az ütemezőt.",
    "answer": false
  },
  {
    "text": "A CPU kihasználtság megmutatja, mennyi időt tölt a CPU a folyamatok végrehajtásával.",
    "answer": true
  },
  {
    "text": "Az átbocsátó képesség a processzor sebességét méri másodpercenkénti műveletek alapján.",
    "answer": false
  },
  {
    "text": "A várakozási idő azt mutatja meg, mennyi időt tölt egy munka várakozással.",
    "answer": true
  },
  {
    "text": "A válaszidő a felhasználói beavatkozásra adott válaszidőt jelenti.",
    "answer": true
  },
  {
    "text": "A közép távú ütemező a folyamatok háttértárra mozgatását ütemezi.",
    "answer": true
  },
  {
    "text": "A hosszú távú ütemező a CPU kihasználtságát optimalizálja közvetlenül.",
    "answer": false
  },
  {
    "text": "A periféria ütemezők döntik el a periféria kiszolgálási sorrendjét.",
    "answer": true
  },
  {
    "text": "A Round-Robin algoritmus nem preemptív ütemezési módszer.",
    "answer": false
  },
  {
    "text": "Az FCFS algoritmus nem preemptív.",
    "answer": true
  },
  {
    "text": "A legrövidebb löketidejű (SJF) algoritmus preemptív ütemezési módszer.",
    "answer": false
  },
  {
    "text": "A legrövidebb hátralévő idejű (SRTF) algoritmus preemptív.",
    "answer": true
  },
  {
    "text": "A HRR algoritmusban a prioritás számítása figyelembe veszi a várakozási időt is.",
    "answer": true
  },
  {
    "text": "A statikus többszintű sorok (SMQ) mentesek a kiéheztetéstől.",
    "answer": false
  },
  {
    "text": "A Multilevel Feedback Queues (MFQ) lehetőséget ad a folyamatok áthelyezésére a várakozási sorok között.",
    "answer": true
  },
  {
    "text": "A MFQ algoritmus nem támogatja a prioritások dinamikus változtatását.",
    "answer": false
  },
  {
    "text": "A statikus többszintű sorokban a folyamatok a sorok között szabadon mozoghatnak.",
    "answer": false
  },
  {
    "text": "A rövid távú ütemező a kernel része, ezért mindig a memóriában van.",
    "answer": true
  },
  {
    "text": "A legrövidebb löketidejű algoritmus csökkenti a konvoj hatás kialakulását.",
    "answer": true
  },
  {
    "text": "A HRR algoritmus a legjobb válaszarányt keresi, figyelembe véve a várakozási időt is.",
    "answer": true
  },
  {
    "text": "A legrövidebb löketidejű algoritmus mindig preemptív.",
    "answer": false
  },
  {
    "text": "A Windows NT alapú rendszerek szálütemezést használnak.",
    "answer": true
  },
  {
    "text": "A UNIX rendszerek szálütemezést alkalmaznak.",
    "answer": false
  },
  {
    "text": "A folyamatok a végrehajtás során több szálra bomolhatnak.",
    "answer": true
  },
  {
    "text": "A szálak az erőforrásokat a folyamatoktól öröklik.",
    "answer": true
  },
  {
    "text": "A nehéz súlyú folyamatok képesek több szálra bomlani.",
    "answer": false
  },
  {
    "text": "A könnyű súlyú folyamatok szálai osztoznak az erőforrásokon.",
    "answer": true
  },
  {
    "text": "A szálak váltásához szükség van környezetváltásra.",
    "answer": false
  },
  {
    "text": "A szálak párhuzamos végrehajtásúak lehetnek, ha a CPU engedi.",
    "answer": true
  },
  {
    "text": "A szálak váltása lassabb, mint a folyamatok váltása.",
    "answer": false
  },
  {
    "text": "A folyamatra jellemző elem például a memória címtartomány.",
    "answer": true
  },
  {
    "text": "A szálra jellemző elem például a regiszterek állapota.",
    "answer": true
  },
  {
    "text": "A verem nem tartozik a szálakhoz.",
    "answer": false
  },
  {
    "text": "A szálak adminisztratív információi külön tárolódnak.",
    "answer": true
  },
  {
    "text": "Független folyamatok nem mutatnak szinkronitást egymással.",
    "answer": true
  },
  {
    "text": "A versengő folyamatok mindig tudnak egymásról.",
    "answer": false
  },
  {
    "text": "A versengő folyamatok jellemzően perifériákért versengenek.",
    "answer": true
  },
  {
    "text": "Az együttműködő folyamatok közös célt valósítanak meg.",
    "answer": true
  },
  {
    "text": "Az együttműködő folyamatok nem cserélnek adatokat.",
    "answer": false
  },
  {
    "text": "Az adatcsere mindig közös memórián keresztül történik.",
    "answer": false
  },
  {
    "text": "A RAM modellben a memória rekeszek egyenként címezhetők.",
    "answer": true
  },
  {
    "text": "A PRAM modell lehetővé teszi a párhuzamos írást és olvasást.",
    "answer": true
  },
  {
    "text": "A CRCW PRAM modell minden párhuzamos műveletet enged.",
    "answer": true
  },
  {
    "text": "Az EREW PRAM modell engedi a párhuzamos írást.",
    "answer": false
  },
  {
    "text": "Az olvasás-olvasás ütközés nem okoz problémát.",
    "answer": true
  },
  {
    "text": "A memória rekesz tartalma egy írás után mindig a régi értéket tartalmazza.",
    "answer": false
  },
  {
    "text": "A pipelined működés azt jelenti, hogy az utasítások egymás után érkeznek.",
    "answer": true
  },
  {
    "text": "A pipelined utasítások interferálnak egymással.",
    "answer": false
  },
  {
    "text": "Az üzenettovábbításos kommunikáció csatornán keresztül történik.",
    "answer": true
  },
  {
    "text": "A SEND parancs a fogadó azonosítóját és az üzenetet tartalmazza.",
    "answer": true
  },
  {
    "text": "A RECEIVE parancs a küldő azonosítóját és az üzenetet tartalmazza.",
    "answer": true
  },
  {
    "text": "A közvetett kommunikáció postaládát használ.",
    "answer": true
  },
  {
    "text": "A postaláda végtelen kapacitású.",
    "answer": false
  },
  {
    "text": "Az aszimmetrikus kommunikáció során a port megnevezése elegendő.",
    "answer": true
  },
  {
    "text": "A farmer-worker modellben a fogadó oldal a feladatot kiosztó szerepét tölti be.",
    "answer": true
  },
  {
    "text": "A csoportkommunikáció során csak egy folyamat kapja meg az üzenetet.",
    "answer": false
  },
  {
    "text": "A szinkronizáció célja a folyamatok közötti összehangolt együttműködés biztosítása.",
    "answer": true
  },
  {
    "text": "Az előidejűség azt jelenti, hogy a folyamatok műveletei időben átfedhetik egymást.",
    "answer": false
  },
  {
    "text": "A randevú esetén a folyamatok műveletei egyidejűleg hajtódnak végre.",
    "answer": true
  },
  {
    "text": "A kölcsönös kizárás célja, hogy a folyamatok szabadon hozzáférhessenek a kritikus szakaszokhoz.",
    "answer": false
  },
  {
    "text": "A kritikus szakaszban egyszerre több folyamat is tartózkodhat.",
    "answer": false
  },
  {
    "text": "A kritikus szakaszra belépés engedélyezése történhet szoftveres vagy hardveres úton.",
    "answer": true
  },
  {
    "text": "A szoftveres kritikus szakaszkezelés gyorsabb, mint a hardveres megoldás.",
    "answer": false
  },
  {
    "text": "A TestAndSet algoritmus egy darab logikai változót használ.",
    "answer": true
  },
  {
    "text": "A Swap algoritmusban minden folyamatnak saját kulcs változója van.",
    "answer": true
  },
  {
    "text": "A Swap algoritmusban a lakat értéke 1 azt jelenti, hogy a kritikus szakasz szabad.",
    "answer": false
  },
  {
    "text": "A TestAndSet és a Swap algoritmus is biztosítja a kölcsönös kizárást.",
    "answer": true
  },
  {
    "text": "A TestAndSet és a Swap algoritmus maradéktalanul teljesíti a várakozási idő minimalizálásának feltételét.",
    "answer": false
  },
  {
    "text": "A szemafor egy univerzális eszköz a szinkronizációs problémák megoldására.",
    "answer": true
  },
  {
    "text": "A szemafor 's' változó értéke lehet negatív.",
    "answer": false
  },
  {
    "text": "A szemafor inicializálható nem negatív értékre.",
    "answer": true
  },
  {
    "text": "A Wait művelet a szemafor 's' értékét csökkenti.",
    "answer": true
  },
  {
    "text": "A Wait művelet neve a holland 'proberen' szóból származik.",
    "answer": true
  },
  {
    "text": "A Signal művelet növeli a szemafor 's' értékét.",
    "answer": true
  },
  {
    "text": "A Signal művelet neve a holland 'verhogen' szóból ered.",
    "answer": true
  },
  {
    "text": "A bináris szemafor esetén a 's' változó értéke csak 0 vagy 1 lehet.",
    "answer": true
  },
  {
    "text": "A monitor objektum szinkronizált eljárásokat tartalmaz.",
    "answer": true
  },
  {
    "text": "A monitorban minden szálnak párhuzamosan hozzáférése van a megosztott adatokhoz.",
    "answer": false
  },
  {
    "text": "A monitor egyidejűleg több szál számára enged hozzáférést az eljárásokhoz.",
    "answer": false
  },
  {
    "text": "A monitor objektumot C.A.R. Hoare dolgozta ki.",
    "answer": true
  },
  {
    "text": "A monitor objektum használata magas szintű, objektumorientált nyelvekben különösen egyszerű.",
    "answer": true
  },
  {
    "text": "Az éheztetés folyamat szintű probléma.",
    "answer": true
  },
  {
    "text": "A holtpont operációs rendszer szintű probléma.",
    "answer": true
  },
  {
    "text": "A preemptív erőforrás például a processzoridő vagy a memória.",
    "answer": true
  },
  {
    "text": "A nem megszakítható erőforrások például a nyomtató vagy a szalagos egység.",
    "answer": true
  },
  {
    "text": "Az erőforrások osztályokba sorolhatók, például egypéldányos és többpéldányos osztályokba.",
    "answer": true
  },
  {
    "text": "A körkörös várakozás kialakulásához legalább három folyamat szükséges.",
    "answer": false
  },
  {
    "text": "A körkörös várakozás a holtpont egyik szükséges feltétele.",
    "answer": true
  },
  {
    "text": "Az erőforrás gráfban a hurok mindig elegendő feltétele a holtpontnak.",
    "answer": false
  },
  {
    "text": "A kizárólagosan használható erőforrások esetén a kölcsönös kizárás kiküszöbölhető.",
    "answer": false
  },
  {
    "text": "A holtpont kialakulásának négy szükséges feltétele: kölcsönös kizárás, foglalás és várakozás, kiszorításmentesség, körkörös várakozás.",
    "answer": true
  },
  {
    "text": "A kölcsönös kizárás megosztható erőforrásoknál nem szükséges.",
    "answer": true
  },
  {
    "text": "A foglalás és várakozás kizárható, ha a folyamatok nem tarthatnak egyszerre több erőforrást.",
    "answer": true
  },
  {
    "text": "A kiszorításmentesség esetén az erőforrást másik folyamat elveheti.",
    "answer": false
  },
  {
    "text": "A körkörös várakozás kizárható, ha az erőforrásokat hierarchikusan számozzuk.",
    "answer": true
  },
  {
    "text": "A hierarchikus erőforrás-sorszámok képesek követni a dinamikus igényeket.",
    "answer": false
  },
  {
    "text": "A holtpont elkerülésének egyik módszere a folyamatok újraindítása.",
    "answer": true
  },
  {
    "text": "A holtpontot mindig adatvesztés nélkül lehet megszüntetni.",
    "answer": false
  },
  {
    "text": "A bankár algoritmus Dijkstra nevéhez fűződik.",
    "answer": true
  },
  {
    "text": "A bankár algoritmus nem engedélyezi a folyamatok párhuzamos futását.",
    "answer": false
  },
  {
    "text": "A bankár algoritmus célja a rendszer biztonságos állapotban tartása.",
    "answer": true
  },
  {
    "text": "A biztonságos állapot nem jelent feltétlenül holtpontmentes állapotot.",
    "answer": false
  },
  {
    "text": "A nem biztonságos állapotban biztosan kialakul a holtpont.",
    "answer": false
  },
  {
    "text": "A bankár algoritmus feltételezi, hogy a folyamatok maximális erőforrás-igénye előre ismert.",
    "answer": true
  },
  {
    "text": "A bankár algoritmus képes kezelni a dinamikusan változó erőforrás-igényeket.",
    "answer": false
  },
  {
    "text": "Az erőforrások igénylése során a rendszer biztonságos állapotát kell figyelembe venni.",
    "answer": true
  },
  {
    "text": "A bankár algoritmus használata mindig garantálja a maximális teljesítményt.",
    "answer": false
  },
  {
    "text": "A bankár algoritmus az erőforrások hatékony kihasználására optimalizált.",
    "answer": false
  },
  {
    "text": "A holtpont kialakulása kizárólag nem preemptív erőforrások esetén lehetséges.",
    "answer": false
  },
  {
    "text": "A bankár algoritmus a folyamatok sorrendjét is figyelembe veszi a döntés során.",
    "answer": true
  },
  {
    "text": "A bankár algoritmus a folyamatok prioritását nem veszi figyelembe.",
    "answer": true
  },
  {
    "text": "A tárolóeszközök csoportosításának egyik fő szempontja, hogy kikapcsolás után megőrzi-e a tartalmát.",
    "answer": true
  },
  {
    "text": "A cache memória mindig a lassabb tárat gyorsítja.",
    "answer": true
  },
  {
    "text": "A cache memória gyorsítótár funkciót lát el, és mindig a CPU vezérli.",
    "answer": false
  },
  {
    "text": "Az operációs rendszer feladata a memória hatékony kezelése.",
    "answer": true
  },
  {
    "text": "A multiprogramozás nem igényel hatékony memóriakezelést.",
    "answer": false
  },
  {
    "text": "A fizikai és a logikai címtartomány összerendelése a memóriakezelés része.",
    "answer": true
  },
  {
    "text": "Az Overlay technika a memóriában való párhuzamos futást biztosítja.",
    "answer": false
  },
  {
    "text": "A DLL állományok dinamikusan töltődnek be a memóriába.",
    "answer": true
  },
  {
    "text": "A memória hézagmentes kitöltése a memóriakezelés egyik célja.",
    "answer": true
  },
  {
    "text": "A háttértár dinamikus használata csökkenti a memóriaigényt.",
    "answer": true
  },
  {
    "text": "Az egypartíciós rendszer több program egyidejű futtatását teszi lehetővé.",
    "answer": false
  },
  {
    "text": "A többpartíciós rendszer fix méretű partíciók használata esetén belső töredezettséget okozhat.",
    "answer": true
  },
  {
    "text": "A dinamikusan kiosztott partíciók nem okoznak külső töredezettséget.",
    "answer": false
  },
  {
    "text": "A Best Fit algoritmus a legkisebb, még elegendő méretű területet választja ki.",
    "answer": true
  },
  {
    "text": "A First Fit algoritmus a legelső megfelelő méretű területet választja ki.",
    "answer": true
  },
  {
    "text": "A Next Fit algoritmus a tár elejéről indítja a keresést minden alkalommal.",
    "answer": false
  },
  {
    "text": "A Worst Fit algoritmus a legnagyobb szabad területből foglal.",
    "answer": true
  },
  {
    "text": "A tárcsere technikát akkor használjuk, ha a teljes memória kihasználatlan.",
    "answer": false
  },
  {
    "text": "A lapszervezés fix méretű lapokkal dolgozik.",
    "answer": true
  },
  {
    "text": "A szegmensszervezés változó méretű szegmensekkel dolgozik.",
    "answer": true
  },
  {
    "text": "A kombinált szervezés a szegmens- és a lapszervezés együttes használata.",
    "answer": true
  },
  {
    "text": "A logikai címek 0-tól indulnak, de a fizikai címek minden folyamat esetén ugyanazok.",
    "answer": false
  },
  {
    "text": "A virtuális memória lehetővé teszi, hogy a fizikai memóriánál nagyobb memóriaterületet használjunk.",
    "answer": true
  },
  {
    "text": "A laphiba azt jelenti, hogy a keresett lap nincs az operatív memóriában.",
    "answer": true
  },
  {
    "text": "Az igény szerinti lapozás csak a szükséges lapokat tölti be a memóriába.",
    "answer": true
  },
  {
    "text": "Az előretekintő lapozás a szükségesnél több lapot is betölthet a memóriába.",
    "answer": true
  },
  {
    "text": "A FIFO lapcsere algoritmus mindig a legfrissebb lapot törli.",
    "answer": false
  },
  {
    "text": "Az LRU algoritmus a legrégebben nem használt lapot távolítja el.",
    "answer": true
  },
  {
    "text": "Az LFU algoritmus a legkevésbé gyakran használt lapot cseréli ki.",
    "answer": true
  },
  {
    "text": "Az NRU algoritmus két bitet használ a döntéshez.",
    "answer": true
  },
  {
    "text": "A globális memória-gazdálkodás egyenlően kezeli a kis és nagy folyamatokat.",
    "answer": false
  },
  {
    "text": "A lokális memória-gazdálkodás a laphibákat csak a folyamat saját lapjai között kezeli.",
    "answer": true
  },
  {
    "text": "A dinamikus lokális memória-gazdálkodás képes a lapok globális átcsoportosítására.",
    "answer": true
  },
  {
    "text": "A working set a folyamat futása során használt lapok aktuális halmaza.",
    "answer": true
  },
  {
    "text": "A laphiba gyakorisága nem alkalmas a memóriaigények mérésére.",
    "answer": false
  },
  {
    "text": "Minél több lap van kiosztva egy folyamathoz, annál kevesebb a laphiba.",
    "answer": true
  },
  {
    "text": "A lapcsere algoritmusok hatékonysága nem függ a hardver támogatottságától.",
    "answer": false
  },
  {
    "text": "A terheléselosztás optimalizálása segíti a rendszer teljesítményét.",
    "answer": true
  },
  {
    "text": "A laphiba kezelése megszakítással történik.",
    "answer": true
  },
  {
    "text": "A FAT egy láncolt lista szerkezetű fájlrendszer.",
    "answer": true
  },
  {
    "text": "A HPFS fájlrendszer B+FA struktúrát használ a töredezettség elkerülésére.",
    "answer": true
  },
  {
    "text": "A NTFS fájlrendszer a Linux rendszerek alapértelmezett fájlrendszere.",
    "answer": false
  },
  {
    "text": "Az UFS fájlrendszer tartalmaz egy úgynevezett 'magic number'-t.",
    "answer": true
  },
  {
    "text": "Az NFS a fájlok hálózaton történő megosztását teszi lehetővé.",
    "answer": true
  },
  {
    "text": "A VFS nem fizikai fájlrendszer, hanem egy interfész a kernel és a fizikai fájlrendszer között.",
    "answer": true
  },
  {
    "text": "A JFS nem támogatja a naplózást.",
    "answer": false
  },
  {
    "text": "Az EXT3 és az EXT4 fájlrendszer már tartalmaz naplózási képességeket.",
    "answer": true
  },
  {
    "text": "Az LTFS a mágnesszalagokra optimalizált fájlrendszer.",
    "answer": true
  },
  {
    "text": "A CDFS kizárólag HDD-kre alkalmazható fájlrendszer.",
    "answer": false
  },
  {
    "text": "A fájlokhoz rendelt információk között szerepelhet a hozzáférési jogosultság is.",
    "answer": true
  },
  {
    "text": "A fájlok eléréséhez a felhasználónak ismernie kell a fizikai tárolás pontos helyét.",
    "answer": false
  },
  {
    "text": "A fájlrendszer egy szoftveres réteg, amely biztosítja a fizikai tároló elérését.",
    "answer": true
  },
  {
    "text": "A fájlok kizárólag szöveg típusú tartalom tárolására alkalmasak.",
    "answer": false
  },
  {
    "text": "A könyvtárak és a kötetek a fájlrendszer logikai elemei.",
    "answer": true
  },
  {
    "text": "A fájlkezelő rendszer feladata a szabad helyek nyilvántartása.",
    "answer": true
  },
  {
    "text": "A szabad blokkok nyilvántartása történhet bittérképes ábrázolással.",
    "answer": true
  },
  {
    "text": "A láncolt lista módszernél minden blokk tartalmazza a következő blokk sorszámát.",
    "answer": true
  },
  {
    "text": "A szabad blokkok csoportjának láncolt listájában egy blokk több blokk címét is tárolhatja.",
    "answer": true
  },
  {
    "text": "A szabad blokkok egybefüggő területeinek leírása nem lehetséges.",
    "answer": false
  },
  {
    "text": "A folytonos terület foglalás esetén a külső tördelődés probléma lehet.",
    "answer": true
  },
  {
    "text": "A láncolt lista módszer előnye, hogy nincs külső tördelődés.",
    "answer": true
  },
  {
    "text": "A FAT tábla két példányban tárolódik a lemezen.",
    "answer": true
  },
  {
    "text": "A FAT tábla segítségével a blokkok közvetlenül elérhetők.",
    "answer": false
  },
  {
    "text": "Az indexelt tárolás minden fájl esetében egy teljes indexblokkot igényel.",
    "answer": true
  },
  {
    "text": "A kis méretű fájlokat általában folytonosan, a nagyokat indexelt módszerrel célszerű tárolni.",
    "answer": true
  },
  {
    "text": "A soros hozzáférés során az adatokat a bájtok sorrendjében lehet elérni.",
    "answer": true
  },
  {
    "text": "Az indexelt-szekvenciális hozzáférés az indexállomány segítségével kulcs alapján keres.",
    "answer": true
  },
  {
    "text": "A fájlok belső szerkezete az operációs rendszer szintjén általában nem ismert.",
    "answer": true
  },
  {
    "text": "A partícionált fájlok soros rész-állományokból állnak.",
    "answer": true
  },
  {
    "text": "A könyvtárakban tárolt információk között szerepelhet a hivatkozás számláló is.",
    "answer": true
  },
  {
    "text": "A könyvtárak törlése csak akkor lehetséges, ha üresek.",
    "answer": true
  },
  {
    "text": "A fa struktúra jellemzője, hogy több elérési út is lehet egy állományhoz.",
    "answer": false
  },
  {
    "text": "A körmentes irányított gráf lehetővé teszi, hogy egy állomány több útvonalon elérhető legyen.",
    "answer": true
  },
  {
    "text": "A könyvtárak keresése történhet rendezetlen vagy rendezett módszerrel is.",
    "answer": true
  },
  {
    "text": "A könyvtárak keresésénél a felező eljárás a gyorsabb megoldás.",
    "answer": true
  },
  {
    "text": "Az állománykezelés során a törlés mindig fizikai törlést jelent.",
    "answer": false
  },
  {
    "text": "A könyvtárak hierarchikus szerkezete megkönnyíti az állományok rendszerezését.",
    "answer": true
  },
  {
    "text": "A könyvtárszerkezetek közül a fa struktúra a legelterjedtebb.",
    "answer": true
  },
  {
    "text": "A perifériák lehetnek ember-gép, gép-gép, vagy adattároló kapcsolattartók.",
    "answer": true
  },
  {
    "text": "A GDI nyomtatók közbeiktatott lapleíró nyelv nélkül is tudnak nyomtatni.",
    "answer": true
  },
  {
    "text": "Az IRQ és a DMA a perifériák szinkronizációjának eszközei.",
    "answer": true
  },
  {
    "text": "A logikai periféria kezelés célja a hardverismeret nélküli perifériahasználat.",
    "answer": true
  },
  {
    "text": "A Device Driver a felhasználói program része.",
    "answer": false
  },
  {
    "text": "A multiprogramozás nem használható I/O műveletek közben.",
    "answer": false
  },
  {
    "text": "Az IOCB tartalmazza az I/O műveletek paramétereit.",
    "answer": true
  },
  {
    "text": "A Start művelet elindítja az I/O műveletet és várakozik a befejezésére.",
    "answer": false
  },
  {
    "text": "A Stop_Device utasítás a hibás I/O műveletek leállítására szolgál.",
    "answer": true
  },
  {
    "text": "Az adatmozgatás során a forrás és cél mindig logikai címek.",
    "answer": false
  },
  {
    "text": "Az elosztott rendszerek lehetnek lazán vagy szorosan csatoltak.",
    "answer": true
  },
  {
    "text": "A lazán csatolt rendszerek közös memóriát használnak.",
    "answer": false
  },
  {
    "text": "Az elosztott rendszer lényege, hogy a felhasználó egy egységes erőforrásként érzékeli.",
    "answer": true
  },
  {
    "text": "Az elosztott rendszerek mindig biztosítják a hibatűrést.",
    "answer": false
  },
  {
    "text": "Az erőforráskezelő programok kezelik az elosztott erőforrások megosztását.",
    "answer": true
  },
  {
    "text": "Az erőforrás megosztásban minden elem egyenlő hozzáférést biztosít.",
    "answer": false
  },
  {
    "text": "A kliens-szerver modell az elosztott rendszerekben gyakori architektúra.",
    "answer": true
  },
  {
    "text": "A nyílt rendszerek rugalmasan bővíthetők hardveresen és szoftveresen.",
    "answer": true
  },
  {
    "text": "A UNIX nem támogatta a nyílt rendszerarchitektúrát.",
    "answer": false
  },
  {
    "text": "A konkurens működés alapja a párhuzamos CPU erőforrások használata.",
    "answer": true
  },
  {
    "text": "A konkurens működés kizárja a folyamatok közötti szinkronizációt.",
    "answer": false
  },
  {
    "text": "A méretezhetőség azt jelenti, hogy a rendszer strukturális változtatás nélkül bővíthető.",
    "answer": true
  },
  {
    "text": "A hibatűrés megvalósításához nem szükséges redundancia.",
    "answer": false
  },
  {
    "text": "A szavazó rendszer a hibatűrés egyik speciális esete.",
    "answer": true
  },
  {
    "text": "Az átlátszóság biztosítja, hogy a felhasználó ne érzékelje a rendszer elosztott mivoltát.",
    "answer": true
  },
  {
    "text": "A hozzáférés átlátszóság és a hely átlátszóság a hálózati átlátszóság alapját képezik.",
    "answer": true
  },
  {
    "text": "A teljesítmény átlátszóság azt jelenti, hogy a rendszer automatikusan reagál a terhelés változásaira.",
    "answer": true
  },
  {
    "text": "A skálázási átlátszóság a rendszer bővíthetőségének rejtettségét biztosítja.",
    "answer": true
  },
  {
    "text": "A hálózati átlátszóság megléte nem befolyásolja a rendszer felhasználhatóságát.",
    "answer": false
  },
  {
    "text": "A hálózati operációs rendszerek nem biztosítanak átlátszóságot.",
    "answer": true
  },
  {
    "text": "Az elosztott operációs rendszerek nem támogatják a számításvándorlást.",
    "answer": false
  },
  {
    "text": "Az elosztott fájlrendszerek a fájlok elérési átlátszóságát biztosítják.",
    "answer": true
  },
  {
    "text": "A nem uniform elnevezési rendszer azonos fájlokat eltérő neveken tesz elérhetővé különböző gépeken.",
    "answer": true
  },
  {
    "text": "A védelem az erőforrásokhoz való szabályozott hozzáférés biztosítása.",
    "answer": true
  },
  {
    "text": "A biztonság fogalma nem kapcsolódik az adatok sérthetetlenségéhez.",
    "answer": false
  },
  {
    "text": "A védelmi tartomány váltása definiálja, mely tartományból melyikbe lehet átlépni.",
    "answer": true
  },
  {
    "text": "Az elérési mátrix cellái a jogosultságokat tartalmazzák.",
    "answer": true
  },
  {
    "text": "A zár-kulcs módszer a jogosultságok kezelésének egyik megoldása.",
    "answer": true
  },
  {
    "text": "A vírusok képesek maguktól terjedni a felhasználó közreműködése nélkül.",
    "answer": false
  },
  {
    "text": "A férgek képesek önállóan, felhasználói beavatkozás nélkül terjedni.",
    "answer": true
  },
  {
    "text": "A trójai programok jellemzően látható, hasznos programnak álcázzák magukat.",
    "answer": true
  },
  {
    "text": "A zsarolóvírus egyfajta adathalász támadás.",
    "answer": false
  },
  {
    "text": "A címhamisítás során a feladó látszólag megbízható forrásból származik.",
    "answer": true
  },
  {
    "text": "A kattintásvadász oldalak pszichológiai manipulációs módszert használnak.",
    "answer": true
  },
  {
    "text": "A Windows NT operációs rendszer 32-bites verziója 1993-ban jelent meg.",
    "answer": true
  },
  {
    "text": "A Windows 3.1 volt az első 32-bites Windows verzió.",
    "answer": false
  },
  {
    "text": "Az NT 4.0 verzióban a UNICODE használata kötelezővé vált.",
    "answer": true
  },
  {
    "text": "A Windows NT fejlesztése során a mikrokernel architektúra mellett döntöttek.",
    "answer": false
  },
  {
    "text": "A Windows NT hibrid kernel architektúrát alkalmaz.",
    "answer": true
  },
  {
    "text": "A Windows NT rendszerek objektumorientált szemléletben készültek.",
    "answer": true
  },
  {
    "text": "A Windows NT rendszerek teljes mértékben támogatják a polimorfizmust és az öröklődést.",
    "answer": false
  },
  {
    "text": "A HAL réteg CPU-tól függő funkciókat tartalmaz.",
    "answer": true
  },
  {
    "text": "A HAL réteg nem része az operációs rendszernek.",
    "answer": true
  },
  {
    "text": "A kernel a CPU architektúrájától függ, de nem a konkrét CPU típustól.",
    "answer": true
  },
  {
    "text": "A kernel módú szálkezelés a Windows NT egyik alapvető funkciója.",
    "answer": true
  },
  {
    "text": "A device driverek kizárólag kernel módban futnak.",
    "answer": true
  },
  {
    "text": "A szűrő típusú driverek például a RAID és hibatűrő funkciókat valósítják meg.",
    "answer": true
  },
  {
    "text": "A fájlrendszer driverek a kernel közvetlen részei.",
    "answer": false
  },
  {
    "text": "Az executive réteg feladatai közé tartozik a memóriakezelés és a biztonsági alrendszer működtetése.",
    "answer": true
  },
  {
    "text": "Az LPC az NT rendszerek folyamatok közötti kommunikációját valósítja meg.",
    "answer": true
  },
  {
    "text": "Az NTDLL.DLL közvetlenül kapcsolódik a hardverhez.",
    "answer": false
  },
  {
    "text": "Az NTDLL.DLL teszi lehetővé a kernel mód és a user mód közötti kommunikációt.",
    "answer": true
  },
  {
    "text": "Az NTDLL.DLL tartalmaz dokumentált és nem dokumentált függvényeket is.",
    "answer": true
  },
  {
    "text": "A rendszerfolyamatok mind user módban futnak.",
    "answer": true
  },
  {
    "text": "Az SMSS felelős a rendszerfolyamatok és szolgáltatások indításáért.",
    "answer": true
  },
  {
    "text": "A LOGON folyamat a felhasználók azonosítását és beléptetését végzi.",
    "answer": true
  },
  {
    "text": "A ServiceController leállítható a rendszer működése közben anélkül, hogy az hatással lenne a működésre.",
    "answer": false
  },
  {
    "text": "A szolgáltatások user módban futnak, de nem feltétlenül szükségesek a rendszer alapvető működéséhez.",
    "answer": true
  },
  {
    "text": "A Service Manager lehetővé teszi a szolgáltatások indítását és leállítását.",
    "answer": true
  },
  {
    "text": "A Windows NT alrendszereiből mára csak a Win32 maradt meg.",
    "answer": true
  },
  {
    "text": "A Win32 alrendszer nem képes a grafikus megjelenítés kezelésére.",
    "answer": false
  },
  {
    "text": "A Win32 API hívásai lehetnek közvetlenek, az alrendszer DLL-jein keresztül, vagy kernel módba átlépő hívások.",
    "answer": true
  },
  {
    "text": "A 64-bites Windows rendszerek nem támogatják a 16-bites és DOS alkalmazásokat natívan.",
    "answer": true
  },
  {
    "text": "A WoW64 alrendszer a 64-bites rendszeren a 32-bites programok futtatására szolgál.",
    "answer": true
  },
  {
    "text": "A WoW64 a 64-bites Windows rendszerekben nem része az alapértelmezett telepítésnek.",
    "answer": false
  },
  {
    "text": "A Windows NT alapú rendszerek architektúrája réteges felépítésű.",
    "answer": true
  },
  {
    "text": "A Plug-And-Play kezelő a Windows 2000-től kezdve része az executive rétegnek.",
    "answer": true
  },
  {
    "text": "A Windows NT rendszerek szigorúan szétválasztják a kernel mód és user mód futtatásokat.",
    "answer": true
  },
  {
    "text": "A Windows NT rendszer hardverfüggetlen, mivel a kernel és a HAL réteg minden CPU architektúrán azonos.",
    "answer": false
  },
  {
    "text": "A Windows NT operációs rendszerek megszakítás- és kivételkezelést is biztosítanak.",
    "answer": true
  },
  {
    "text": "A megszakításokat mindig szoftver alapú események váltják ki.",
    "answer": false
  },
  {
    "text": "A kivételkezelő modul feladata a hibák beazonosítása és a futás folytatása.",
    "answer": true
  },
  {
    "text": "A Windows NT rendszerben a trap a szál futásának megszakítását jelenti.",
    "answer": true
  },
  {
    "text": "A trapkezelő szoftveres úton képes kezelni a problémákat.",
    "answer": true
  },
  {
    "text": "Az objektumkezelő biztosítja az erőforrások elérését és védelmét.",
    "answer": true
  },
  {
    "text": "Az executive objektumok kizárólag kernel objektumokból épülnek fel.",
    "answer": false
  },
  {
    "text": "A handle a folyamatok számára biztosít hozzáférést az objektumokhoz.",
    "answer": true
  },
  {
    "text": "A kölcsönös kizárás biztosítása nem szükséges több magos rendszerek esetén.",
    "answer": false
  },
  {
    "text": "A Spin-Lock használata kizárja a megszakításokat és kivételeket a kritikus szakaszokban.",
    "answer": true
  },
  {
    "text": "A Dispatcher Object lehetőséget ad a várakoztatott folyamatok kezelésére.",
    "answer": true
  },
  {
    "text": "A WaitForSingleObject függvény a szinkronizációs objektumokhoz kapcsolódik.",
    "answer": true
  },
  {
    "text": "Az LPC a felhasználói alkalmazások közötti kommunikációra szolgál.",
    "answer": false
  },
  {
    "text": "Az LPC kapcsolat létrejöhet kernel és user módú komponensek között.",
    "answer": true
  },
  {
    "text": "Az LPC rövid üzenetek esetén 256 bájtnál nagyobb puffert igényel.",
    "answer": false
  },
  {
    "text": "A Windows NT rendszerekben a szálak a folyamatokon belüli entitások.",
    "answer": true
  },
  {
    "text": "Minden szál rendelkezik saját kernel és user veremtárral.",
    "answer": true
  },
  {
    "text": "A Thread ID és a Process ID külön névtérből kerül kiosztásra.",
    "answer": false
  },
  {
    "text": "A PEB (Process Environment Block) a kernel címterében található.",
    "answer": false
  },
  {
    "text": "A Win32 CreateProcess függvény több rendszerkomponenst von be a folyamat létrehozásába.",
    "answer": true
  },
  {
    "text": "A szálak alapértelmezett állapota a felfüggesztett állapot.",
    "answer": true
  },
  {
    "text": "A KeStartThread hívása után a szál készen áll a futtatásra.",
    "answer": true
  },
  {
    "text": "Az ütemezés Windows NT alatt nem preemptív.",
    "answer": false
  },
  {
    "text": "A szálak prioritásai alapvetően a szálhoz rendelt prioritási szintekből származnak.",
    "answer": true
  },
  {
    "text": "A processzor affinitás határozza meg, melyik magon futhat egy szál.",
    "answer": true
  },
  {
    "text": "A kvantum időszelet határozza meg, meddig futhat megszakítás nélkül egy szál.",
    "answer": true
  },
  {
    "text": "A kvantum értéke a Windows NT Workstation esetén 36.",
    "answer": false
  },
  {
    "text": "A prioritási szintek 0 és 31 között mozognak a Windows NT rendszerben.",
    "answer": true
  },
  {
    "text": "A real-time prioritási szintek 1 és 15 közé esnek.",
    "answer": false
  },
  {
    "text": "Az Idle szinthez 0 prioritásérték tartozik.",
    "answer": false
  },
  {
    "text": "A szál állapota lehet Ready, Running, vagy Terminated.",
    "answer": true
  },
  {
    "text": "A Standby állapotban lévő szál már a futtatásra kiválasztott szál.",
    "answer": true
  },
  {
    "text": "A Transition állapotba kerülés oka a kernel veremtár kilapozása.",
    "answer": true
  },
  {
    "text": "A szálak kvantum értéke órajelmegszakításonként csökken.",
    "answer": true
  },
  {
    "text": "A rendszer szigorúan megkülönbözteti a kernel és user módú futtatást.",
    "answer": true
  },
  {
    "text": "A Windows NT operációs rendszer ütemezője egy dedikált modulban helyezkedik el.",
    "answer": false
  },
  {
    "text": "A Windows NT alapú rendszerek ütemezése szál alapú, prioritásvezérelt és preemptív.",
    "answer": true
  },
  {
    "text": "A szálak állapota között nincs közvetlen átmenet a Waiting és a Running állapot között.",
    "answer": false
  },
  {
    "text": "A Windows NT operációs rendszerek esetén a szálak prioritásai sosem változhatnak dinamikusan.",
    "answer": false
  },
  {
    "text": "A Windows 10 feladatkezelője a memóriamegoszlás grafikus ábrázolására is képes, ahol az egérrel a kurzort mozgatva jelenik meg a részletes információ.",
    "answer": true
  },
  {
    "text": "A 'Készenléti' memória mindig teljes mértékben rendelkezésre álló szabad memória.",
    "answer": false
  },
  {
    "text": "A Windows NT memóriakezelője a logikai címeket a fizikai címekhez rendeli hozzá a címtranszformáció segítségével.",
    "answer": true
  },
  {
    "text": "A PAE lehetővé teszi, hogy a 32-bites rendszerek egyidejűleg több folyamat számára is 4GB-nál nagyobb címtartományt biztosítsanak.",
    "answer": false
  },
  {
    "text": "Az IA-64 architektúra kizárólag az Itanium sorozatú processzorokban került megvalósításra.",
    "answer": true
  },
  {
    "text": "A 64-bites rendszerekben minden egyes folyamat akár 8TB memóriaterületet is igénybe vehet.",
    "answer": false
  },
  {
    "text": "A memóriaigényes folyamatok memóriafoglalása két lépésben történik: először Reserve, majd Commit.",
    "answer": true
  },
  {
    "text": "A Reserve lépés során a rendszer azonnal lefoglalja a fizikai memória területet a folyamat számára.",
    "answer": false
  },
  {
    "text": "A Windows NT rendszerek memóriakezelésében a Clustering a lapozási műveletek hatékonyságát javítja a lokalitás elv alapján.",
    "answer": true
  },
  {
    "text": "A Prefetcher kizárólag a rendszerindításkor működik, alkalmazások indításakor nem.",
    "answer": false
  },
  {
    "text": "A Superfetch szolgáltatás a memórialapokat életciklus szerint priorizálja, és állít össze egy stand-by listát.",
    "answer": true
  },
  {
    "text": "A ReadyBoost a RAM méretét növeli meg a flash tárhely használatával.",
    "answer": false
  },
  {
    "text": "A Memory Mapped Files lehetővé teszi a fájlok megosztott, memóriaként történő elérését.",
    "answer": true
  },
  {
    "text": "A Copy-on-Write mechanizmus lusta kiértékelést alkalmaz, azaz a másolatkészítés csak akkor történik meg, amikor tényleges írási művelet történik.",
    "answer": true
  },
  {
    "text": "A 32-bites Windows NT rendszerek memóriatérképe mindig 2GB a rendszer számára és 2GB a felhasználói folyamatok számára, függetlenül a /3GB kapcsolótól.",
    "answer": false
  },
  {
    "text": "A Windows NT memóriavédelem garantálja, hogy egy folyamat nem írhat egy másik folyamat címterületére.",
    "answer": true
  },
  {
    "text": "A szekció objektumokhoz hozzárendelt fájlok és memórialapok osztott elérésűek lehetnek több folyamat számára is.",
    "answer": true
  },
  {
    "text": "A nem lapozott memória tárak tartalma szükség esetén áthelyezhető a háttértárra.",
    "answer": false
  },
  {
    "text": "A kernel módú komponensek memóriafoglalása kizárólag nem lapozott memória tárból történik.",
    "answer": false
  },
  {
    "text": "A Copy-on-Write mechanizmus optimalizálja a memóriahasználatot, mivel elkerüli a felesleges másolatkészítést.",
    "answer": true
  },
  {
    "text": "A Windows NT rendszerek memóriakezelése nem támogatja a megosztott memória létrehozását.",
    "answer": false
  },
  {
    "text": "A szálak user módú veremtára inicializálásakor a Commit művelet csak néhány lapnyi memóriát foglal le, míg a Reserve a teljes címtartományt lefoglalja.",
    "answer": true
  },
  {
    "text": "A lusta kiértékelés (Lazy Evaluation) elve alapján a rendszer erőforrás-igényes műveletek végrehajtását addig késlelteti, amíg az ténylegesen szükségessé nem válik.",
    "answer": true
  },
  {
    "text": "A Windows NT memóriakezelése nem engedélyezi a memórialapok aszinkron módú betöltését.",
    "answer": false
  },
  {
    "text": "A Windows NT rendszerekben a memória foglalása fizikai lapok szintjén történik, nem bájtszintű címzéssel.",
    "answer": true
  },
  {
    "text": "Az NTFS fájlrendszer maximális fájlmérete 16TB, míg a maximális partíciómérete 256TB lehet.",
    "answer": true
  },
  {
    "text": "A FAT32 fájlrendszer támogatja a hosszú fájlneveket, maximum 255 karakter hosszúságig.",
    "answer": true
  },
  {
    "text": "Az NTFS 'Convert' parancs segítségével közvetlenül lehet a FAT32 fájlrendszert NTFS-re konvertálni adatvesztés nélkül.",
    "answer": true
  },
  {
    "text": "Az NTFS log fájlja egy körkörös szervezésű tömb, amely redundáns példányokat tartalmaz a biztonság érdekében.",
    "answer": true
  },
  {
    "text": "Az NTFS fájlrendszer képes automatikusan javítani a hibás szektorok tartalmát, ha azok olvashatók maradnak.",
    "answer": true
  },
  {
    "text": "Az alternatív adatfolyamok (ADS) tartalma látható a fájlméret alapján a felhasználói nézetben.",
    "answer": false
  },
  {
    "text": "Az alternatív adatfolyamok (ADS) elvesznek, ha az adott fájlt egy FAT32 típusú fájlrendszerre másoljuk.",
    "answer": true
  },
  {
    "text": "Az NTFS titkosítási funkciója, az EFS, már a Windows NT 4.0 verzióban is elérhető volt.",
    "answer": false
  },
  {
    "text": "A NTFS tömörítési funkciója a ZIP formátumot használó LZ77 algoritmust alkalmazza.",
    "answer": true
  },
  {
    "text": "A kötet formázása során a cluster méretét a felhasználó szabadon választhatja meg bármilyen értékre.",
    "answer": false
  },
  {
    "text": "A Logical Cluster Number (LCN) a kötet fizikai címtartományának sorszámozott blokkjait jelöli.",
    "answer": true
  },
  {
    "text": "A Virtual Cluster Number (VCN) a fájl logikai tárolóblokkjait jelöli, amelyek nem feltétlenül folytonosak a fizikai tárolón.",
    "answer": true
  },
  {
    "text": "A fájlok és könyvtárak az NTFS-ben egyedi 64-bites referenciaszámmal azonosíthatók, amely tartalmazza a MFT rekord sorszámát is.",
    "answer": true
  },
  {
    "text": "Az NTFS Metaadatok (Metadata) nem tartalmazzák a rendszerfájlok adatait.",
    "answer": false
  },
  {
    "text": "A Master File Table (MFT) a rendszer összes fájlját és azok tulajdonságait tartalmazza, kivéve a felhasználó által létrehozott fájlokat.",
    "answer": false
  },
  {
    "text": "A Master File Table első 16 rekordja kizárólag rendszerfájlokat tartalmaz, amelyek a felhasználó számára rejtettek.",
    "answer": true
  },
  {
    "text": "A nem rezidens attribútumok mindig a Master File Table-en kívül tárolódnak, különálló cluster blokkokban.",
    "answer": true
  },
  {
    "text": "A nem rezidens attribútumok tárolásakor a VCN és LCN hozzárendelés a fájlok töredezettségének kezelésére szolgál.",
    "answer": true
  },
  {
    "text": "A rezidens attribútumok soha nem tartalmazhatnak tömörített vagy titkosított adatokat.",
    "answer": true
  },
  {
    "text": "A fájlok attribútumai közé tartozhat a létrehozási idő, a módosítási idő, az írásvédettség és a tömörítettség is.",
    "answer": true
  },
  {
    "text": "Az operációs rendszer legfontosabb funkciója a felhasználó programjainak közvetlen hardver-hozzáférés biztosítása.",
    "answer": false
  },
  {
    "text": "A kernel üzemmód lehetővé teszi, hogy a program közvetlenül manipulálja a hardvert.",
    "answer": true
  },
  {
    "text": "A processzek létrehozásakor a folyamatok automatikusan öröklik a szülőfolyamat összes erőforrását.",
    "answer": false
  },
  {
    "text": "A Spin-lock kizárja a megszakításokat a kritikus szakaszokban.",
    "answer": true
  },
  {
    "text": "A rendszerhívások kizárólag kernel módból érhetők el.",
    "answer": false
  },
  {
    "text": "Az FCFS algoritmus nem preemptív, és nem garantálja a rövid válaszidőt.",
    "answer": true
  },
  {
    "text": "A futó folyamatok listáját a Dispatcher kezeli, nem az ütemező.",
    "answer": false
  },
  {
    "text": "A lapozási mechanizmus lényege, hogy minden folyamat számára fix méretű lapokat foglaljon le előre.",
    "answer": false
  },
  {
    "text": "A monitor programszerkezet legalább egy feltételváltozót igényel.",
    "answer": true
  },
  {
    "text": "A folyamatok közötti kommunikációban a közvetlen megnevezés mindig a partner folyamat azonosítóját igényli.",
    "answer": true
  },
  {
    "text": "A konkurens működés alapvetően feltételezi a megosztott erőforrások használatát.",
    "answer": true
  },
  {
    "text": "Az SMP rendszerek csak preemptív ütemezéssel működhetnek.",
    "answer": false
  },
  {
    "text": "A MAR regiszter a memória tartalmát tárolja olvasás közben.",
    "answer": false
  },
  {
    "text": "Az UFS fájlrendszer nem támogat naplózást.",
    "answer": false
  },
  {
    "text": "A Plug and Play technológia lehetővé teszi, hogy egy eszköz beállításait a BIOS állítsa be automatikusan.",
    "answer": false
  },
  {
    "text": "A kernel módú szálak általában nem használnak veremtárat.",
    "answer": false
  },
  {
    "text": "A Round-Robin algoritmus hatékonyságát nagymértékben befolyásolja az időszelet mérete.",
    "answer": true
  },
  {
    "text": "A középtávú ütemező kizárólag a CPU erőforrások kiosztásáért felelős.",
    "answer": false
  },
  {
    "text": "A paging rendszer megakadályozza a teljes fizikai memória felhasználását.",
    "answer": false
  },
  {
    "text": "A swap terület a folyamatok által ideiglenesen nem használt memórialapokat tárolja.",
    "answer": true
  },
  {
    "text": "A hosszú távú ütemező fő feladata a processzor kihasználtságának maximalizálása.",
    "answer": false
  },
  {
    "text": "A Windows NT ütemezője nem képes dinamikus prioritáskezelésre.",
    "answer": false
  },
  {
    "text": "A futó folyamatok mindig a legmagasabb prioritási szinthez tartoznak.",
    "answer": false
  },
  {
    "text": "Az IPC (Interprocess Communication) megvalósítható megosztott memória segítségével.",
    "answer": true
  },
  {
    "text": "A mikrokernel architektúra előnye a szolgáltatások izolációja.",
    "answer": true
  },
  {
    "text": "Az NTFS naplózási funkciója biztosítja a rendszer teljes helyreállítását áramkimaradás esetén.",
    "answer": false
  },
  {
    "text": "A kernel módban futó programok nem hozhatnak létre új folyamatokat.",
    "answer": false
  },
  {
    "text": "A szálak nem képesek megosztani a globális változókat.",
    "answer": false
  },
  {
    "text": "A dispatcher modul felelős a szálak közötti váltásért.",
    "answer": true
  },
  {
    "text": "A kritikus szakaszba való belépés garantáltan meghiúsulhat, ha a rendszer preemptív ütemezést alkalmaz.",
    "answer": false
  },
  {
    "text": "Az LPC mechanizmus nem alkalmazható a kernel és user mód közötti kommunikációra.",
    "answer": false
  },
  {
    "text": "A közvetett kommunikáció mindig postafiókokat használ.",
    "answer": false
  },
  {
    "text": "A BIOS feladata a rendszerindítás támogatása és hardver inicializálás.",
    "answer": true
  },
  {
    "text": "A veremtár kizárólag a programok lokális változóinak tárolására szolgál.",
    "answer": false
  },
  {
    "text": "A Windows NT nem használ virtualizációt a memóriakezelés során.",
    "answer": false
  },
  {
    "text": "A mutual exclusion (kölcsönös kizárás) biztosítása szoftveresen is megvalósítható.",
    "answer": true
  },
  {
    "text": "Az NT ütemezője csak 32 prioritási szintet támogat.",
    "answer": false
  },
  {
    "text": "A Spin-lockok kizárólag többprocesszoros rendszerekben hasznosak.",
    "answer": false
  },
  {
    "text": "Az előretekintő lapozás a rendszer előrejelzésein alapul.",
    "answer": true
  },
  {
    "text": "A logikai címek mindig a fizikai címekkel egyeznek meg.",
    "answer": false
  },
  {
    "text": "Az NT rendszerben a szálak a prioritásuk alapján kerülnek futtatásra.",
    "answer": true
  },
  {
    "text": "A 32-bites rendszerek nem képesek a 4GB-nál nagyobb címtartomány kezelésére.",
    "answer": false
  },
  {
    "text": "A DMA lehetővé teszi az adatátvitelt a CPU közvetlen beavatkozása nélkül.",
    "answer": true
  },
  {
    "text": "A szálak váltása során a környezetmentés nem szükséges.",
    "answer": false
  },
  {
    "text": "A kernel ütemező modulja szigorúan egyetlen komponensből áll.",
    "answer": false
  },
  {
    "text": "A Windows NT felhasználói módja nem tartalmaz semmilyen jogosultságkezelést.",
    "answer": false
  },
  {
    "text": "A Dispatcher és a Scheduler funkciói teljesen elkülönülnek a Windows rendszerekben.",
    "answer": false
  },
  {
    "text": "A Windows NT rendszerek nem támogatják a prioritás öröklést.",
    "answer": false
  },
  {
    "text": "A blokkok szektorokból állnak, de a logikai clusterek nem feltétlenül azonosak a fizikai blokkokkal.",
    "answer": true
  }
]




