[
  {
    "text": "Az NT ütemezője a kernel módban, egy darab ütemező modulban található.",
    "answer": false
  },
  {
    "text": "A tároló méretét megnövelve a FAT mérete nem arányosan növekszik.",
    "answer": false
  },
  {
    "text": "Az exokernel gyakorlatilag rendszer rutinkönyvtárat jelent.",
    "answer": true
  },
  {
    "text": "A monitor programszerkezetben két feltételváltozó és két művelet van.",
    "answer": false
  },
  {
    "text": "A biztonsági másolat egy adott állomány dupla(esetleg többszörös) tárolása, az eredeti állománnyal egyező tárhelyen.",
    "answer": false
  },
  {
    "text": "Az operációs rendszer fő célja, hogy a felhasználó zökkenőmentesen futtathassa a saját programját.",
    "answer": true
  },
  {
    "text": "A multiprogramozott rendszerekben egy időben csak egy folyamat lehet futó állapotban.",
    "answer": false
  },
  {
    "text": "Az FCFS algoritmus preemptív működésű.",
    "answer": false
  },
  {
    "text": "A szálak önálló folyamatok, amelyek külön memóriaterületen futnak.",
    "answer": false
  },
  {
    "text": "A kritikus szakaszban egyszerre csak egy folyamat tartózkodhat.",
    "answer": true
  },
  {
    "text": "A holtpont négy feltétele közül a kölcsönös kizárás mindig fennáll, ha nem megosztható erőforrásokról van szó.",
    "answer": true
  },
  {
    "text": "A lapozás fix méretű memóriablokkokkal dolgozik.",
    "answer": true
  },
  {
    "text": "A fájl logikai információk gyűjteménye, amelyet egyedileg azonosíthatunk a fájlnév segítségével.",
    "answer": true
  },
  {
    "text": "A perifériák a számítógép beágyazott részei, a CPU részei.",
    "answer": false
  },
  {
    "text": "Az operációs rendszer felelős a felhasználói azonosításért és a hozzáférési jogok ellenőrzéséért.",
    "answer": true
  },
  {
    "text": "A Windows NT kernel architektúrája réteges szerkezetű.",
    "answer": true
  },
  {
    "text": "Az elosztott rendszerek célja többek között a párhuzamos feldolgozás és a hibatűrés biztosítása.",
    "answer": true
  }
]